"use strict"

// Задача 1 Объединить два массива

// let arr1 = ["a", "b", "c"];
// let arr2 = [1, 2, 3];
// let result = arr1.concat(arr2);



// Задача 2 Добавить в массив ["a", "b", "c"] буквы "d", "e", "f" (они лежат не в массиве), 2 вариант - добавьте буквы в начало массива

// let arr1 = ["a", "b", "c"];
// arr1.push("d", "e", "f"); // добавление в конец
// arr1.unshift("d", "e", "f"); // добавление в начало



// Задача 3 Превратить массив [1, 2, 3] в [3, 2, 1]

// let arr2 = [1, 2, 3];
// arr2.reverse();



// Задача 4 Отсортировать массив [1, 2, 235, 2345356, 3, 2] по возрастанию и по убыванию

// let arr3 = [1, 2, 235, 2345356, 3, 2];

// arr3.sort((a, b) => a - b); // по возрастанию
// arr3.sort((a, b) => b - a); // по убыванию



// Задача 5 Дан массив [1, 234, 2345, 234, 234523, 2, 1, 1, 453, 345] необходимо удалить повторяющиеся элементы в массиве

let arr = [1, 234, 2345, 234, 234523, 2, 1, 1, 453, 345, 2, 45, 47, 3, 3, 1, 22];

let newArr = [];

arr.forEach(function(number) {

    if (newArr.includes(number, 0)) {
            return;
        } else {
            newArr.push(number);
        }
})







