"use strict"

// Задача 6
// let number;
// do {
//     number = prompt('Введите число больше 100', '');
// } while (number < 100);

//  let num;

// do {
//     num = prompt("Введите число, большее 100?", 0);
//   } while (num <= 100 && num);

// Проверка && num вычисляется в false, когда num имеет значение null или пустая строка ''. В этом случае цикл while тоже нужно прекратить. ПОЯСНИТЬ!!!!!!!
// Кстати, сравнение num <= 100 при вводе null даст true, так что вторая проверка необходима.



// Задача 7
// for (let i = 1; i < 10; i++) {
//     if (i % i-1 == 0) continue;
//     alert(i);
//   }

