"use strict"

// // Задача 1

// alert( null || 2 || undefined ); // выведет 2

// // Задача 2

// alert( alert(1) || 2 || alert(3) ); // выведет 1 (undefined), затем 2

// // Задача 3

// alert( 1 && null && 2 ); // выведет null

// // Задача 4

// alert( alert(1) && alert(2) ); // выведет 1 и undefined

// // Задача 5

// alert( null || 2 && 3 || 4 ); // выведет 3

// // Задача 6

// let age = 105;
// if (age >= 14 && age <= 90) {
//     alert(age);
// }

// Задача 7

// let age = 66;
// if (age != (age >= 14 && age <= 90)) {
//     alert(age);
// }

// if (age < 14 || age > 90)
// if (!(age >=14 && age <=90))



// Напишите условие if для проверки, что значение переменной age НЕ находится в диапазоне 14 и 90 включительно.
// Напишите два варианта: первый с использованием оператора НЕ !, второй – без этого оператора.

